pde_tutorial/d1_approx.org
#+TITLE: Approximation example with XFEM (incl. pde/python)
#+AUTHOR: Christoph Lehrenfeld
#+PROPERTY: header-args *python* :tangle yes :results output type: scalar format: org
#+email: christoph.lehrenfeld AT rwth-aachen DOT de
# COMMENT +INFOJS_OPT: toc:nil view:slide
#+OPTIONS: ^:nil
#+OPTIONS: tex:t  
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="media/style.css" />
-----
We explain a simple approximation example.
* Description of the considered example
  We consider an L2-approximation problem of a domain-wise smooth function which is 
  discontinuous across an implicitly prescribed interface.
  
  We consider a domain $\Omega$ which is divided into two subdomains $\Omega_1$ 
  and $\Omega_2$ by the interface $\Gamma$ which is only *implicitely* described.
  On this domain we aim on solving the following $L^2(\Omega)$ - problem for $u_h \in V_h^\Gamma$:
  \begin{equation}
  \sum_{i=1,2} \int_{\Omega_i} u_h · v_h dx
  = \sum_{i=1,2} \int_{\Omega_i} u   · v_h dx, \quad \forall v_h \in V_h^\Gamma
  \end{equation}
  with the (special) finite element space $V_h^\Gamma$. Next, we will explain how this is achieved 
  in NGSolve/ngsxfem through the pde-file and how simple modifications can be achieved and 
  additional information can be gathered by changes in the pde-file and additional functionality 
  through python.
  
* Description and Explanation of the pde-file
** Geometry and mesh
   In the NGSolve pde-file the components for setting up the problem is defined. 
   First, a [[(geometry)][geometry]] and a [[(mesh)][mesh]] is loaded:
   #+NAME: mesh
   #+BEGIN_SRC pde +n -r
  # load geometry
  geometry = d1_approx.in2d                                        (ref:geometry)
  # and mesh
  mesh = d1_approx.vol.gz                                              (ref:mesh)
   #+END_SRC 
** Additional libraries
   Next, additional librarys are loaded. These are the [[(libngsxfem)][ngsxfem-library which adds XFEM-functionality]] 
   to NGSolve and [[(libngsxfempy)][a python module which transfers some of this functionality to python]]. 
   
   The line "[[(pymodd1)][pymodule = d1_approx]]" enforces loading of a small python module which adds a tiny 
   bit of additional functionality only for this test case written in python. The content of this 
   specific python module is discussed [[pymodule][later]].
   #+NAME: libs
   #+BEGIN_SRC pde +n -r
  #load xfem-library and python-bindings
  shared = libngsxfem_xfem                                       (ref:libngsxfem)
  shared = libngsxfem_py                                       (ref:libngsxfempy)
  pymodule = d1_approx                                              (ref:pymodd1)
   #+END_SRC 
** Constants, solutions and level set function
   Some simple constants are defined:
   #+NAME: const
   #+BEGIN_SRC pde +n -r
define constant heapsize = 1e9

define constant R = 0.4
define constant one = 1.0
   #+END_SRC 
   
   Now, we define a specific level set function which represents the interface as its zero level.
   Here, the interface is a simple circle with radius R (=0.4), i.e.
   \begin{equation}
   \phi(x) = \sqrt{x^2+y^2} - R
   \end{equation}
   #+NAME: lset
   #+BEGIN_SRC pde +n -r
# interface description as zero-level
define coefficient lset
( sqrt(x*x+y*y) - R),       
   #+END_SRC 
   
   The right hand side term $u$ (which is at the same time the reference solution) is defined.
   $u$ is needed for the setup of the r.h.s.,  in order to prescribe suitable Dirichlet boundary conditions 
   and to evaluate errors later. Here, we choose
   \begin{equation}
   u(x) = \left\{\begin{array}{clc} 0.5&, & \text{in } \Omega_1 \\  sin(x^2+y^2-R^2)&, & \text{in } \Omega_2 \end{array} \right.
   \end{equation}
   #+NAME: sol
   #+BEGIN_SRC pde +n -r
# solution u- in 'inner' domain (Omega_1)
define coefficient solneg
0.5,

# solution u+ in 'outer' domain (Omega_2)
define coefficient solpos
(sin((x*x+y*y-R*R))),
   #+END_SRC 
