pde_tutorial/d1_approx.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Approximation example with XFEM (incl. pde/python)</title>
<!-- 2015-01-05 Mo 18:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Christoph Lehrenfeld" />
<link rel="stylesheet" type="text/css" href="media/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Approximation example with XFEM (incl. pde/python)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Description of the considered example</a></li>
<li><a href="#sec-2">2. Description and Explanation of the pde-file</a>
<ul>
<li><a href="#sec-2-1">2.1. Geometry and mesh</a></li>
<li><a href="#sec-2-2">2.2. Additional libraries</a></li>
<li><a href="#sec-2-3">2.3. Constants, solutions and level set function</a></li>
<li><a href="#sec-2-4">2.4. (Extended) Finite element space</a></li>
<li><a href="#sec-2-5">2.5. Gridfunction, linear and bilinear forms</a></li>
<li><a href="#sec-2-6">2.6. Solver</a></li>
<li><a href="#sec-2-7">2.7. Visualization</a></li>
<li><a href="#sec-2-8">2.8. Error calculatoin</a></li>
<li><a href="#sec-2-9">2.9. Things to try with the pde-file here:</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Additional investigations with python</a>
<ul>
<li><a href="#sec-3-1">3.1. Simple python start-off</a></li>
<li><a href="#sec-3-2">3.2. Import ngsolve and xfem functionality to python </a></li>
<li><a href="#sec-3-3">3.3. Small functions for inspections:</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. Print dofs per elements:</a></li>
<li><a href="#sec-3-3-2">3.3.2. Show shape functions</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. Put everything together</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Resulting files</a></li>
</ul>
</div>
</div>
<hr  />
<p>
We explain a simple approximation example.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Description of the considered example</h2>
<div class="outline-text-2" id="text-1">
<p>
We consider an L2-approximation problem of a domain-wise smooth function which is 
discontinuous across an implicitly prescribed interface.
</p>

<p>
We consider a domain \(\Omega\) which is divided into two subdomains \(\Omega_1\) 
and \(\Omega_2\) by the interface \(\Gamma\) which is only <b>implicitely</b> described.
On this domain we aim on solving the following \(L^2(\Omega)\) - problem for \(u_h \in V_h^\Gamma\):
</p>
\begin{equation}
\sum_{i=1,2} \int_{\Omega_i} u_h · v_h dx
= \sum_{i=1,2} \int_{\Omega_i} u   · v_h dx, \quad \forall v_h \in V_h^\Gamma
\end{equation}
<p>
with the (special) finite element space \(V_h^\Gamma\). Next, we will explain how this is achieved 
in NGSolve/ngsxfem through the pde-file and how simple modifications can be achieved and 
additional information can be gathered by changes in the pde-file and additional functionality 
through python.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Description and Explanation of the pde-file</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Geometry and mesh</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In the NGSolve pde-file the components for setting up the problem is defined. 
First, a <a href="#coderef-geometry"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-geometry');" onmouseout="CodeHighlightOff(this, 'coderef-geometry');">geometry</a> and a <a href="#coderef-mesh"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-mesh');" onmouseout="CodeHighlightOff(this, 'coderef-mesh');">mesh</a> is loaded:
</p>
<div class="org-src-container">

<pre class="src src-pde" id="mesh"><span class="linenr">1: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">load geometry</span>
<span id="coderef-geometry" class="coderef-off"><span class="linenr">2: </span><span style="color: #ccaa8f; font-weight: bold;">geometry = d1_approx.in2d</span></span>
<span class="linenr">3: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">and mesh</span>
<span id="coderef-mesh" class="coderef-off"><span class="linenr">4: </span><span style="color: #ccaa8f; font-weight: bold;">mesh = d1_approx.vol.gz</span></span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Additional libraries</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Next, additional librarys are loaded. These are the <a href="#coderef-libngsxfem"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-libngsxfem');" onmouseout="CodeHighlightOff(this, 'coderef-libngsxfem');">ngsxfem-library which adds XFEM-functionality</a> 
to NGSolve and <a href="#coderef-libngsxfempy"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-libngsxfempy');" onmouseout="CodeHighlightOff(this, 'coderef-libngsxfempy');">a python module which transfers some of this functionality to python</a>. 
</p>

<p>
The line "<a href="#coderef-pymodd1"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-pymodd1');" onmouseout="CodeHighlightOff(this, 'coderef-pymodd1');">pymodule = d1_approx</a>" enforces loading of a small python module which adds a tiny 
bit of additional functionality only for this test case written in python. The content of this 
specific python module is discussed <a href="#pymodule">later</a>.
</p>
<div class="org-src-container">

<pre class="src src-pde" id="libs"><span class="linenr">5: </span><span style="color: #99968b;">#</span><span style="color: #99968b;">load xfem-library and python-bindings</span>
<span id="coderef-libngsxfem" class="coderef-off"><span class="linenr">6: </span><span style="color: #ccaa8f; font-weight: bold;">shared = libngsxfem_xfem</span></span>
<span id="coderef-libngsxfempy" class="coderef-off"><span class="linenr">7: </span><span style="color: #ccaa8f; font-weight: bold;">shared = libngsxfem_py</span></span>
<span id="coderef-pymodd1" class="coderef-off"><span class="linenr">8: </span><span style="color: #ccaa8f; font-weight: bold;">pymodule = d1_approx</span></span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Constants, solutions and level set function</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Some simple constants are defined:
</p>
<div class="org-src-container">

<pre class="src src-pde" id="const"><span class="linenr"> 9: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> heapsize = 1e9
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> R = 0.4
<span class="linenr">12: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">constant</span> one = 1.0
</pre>
</div>

<p>
Now, we define a specific level set function which represents the interface as its zero level.
Here, the interface is a simple circle with radius R (=0.4), i.e.
</p>
\begin{equation}
\phi(x) = \sqrt{x^2+y^2} - R
\end{equation}
<div class="org-src-container">

<pre class="src src-pde" id="lset"><span class="linenr">13: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">interface description as zero-level</span>
<span class="linenr">14: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> lset
<span class="linenr">15: </span>( sqrt(x*x+y*y) - R),
</pre>
</div>

<p>
The right hand side term \(u\) (which is at the same time the reference solution) is defined.
\(u\) is needed for the setup of the r.h.s.,  in order to prescribe suitable Dirichlet boundary conditions 
and to evaluate errors later. Here, we choose
</p>
\begin{equation}
u(x) = \left\{\begin{array}{clc} 0.5&, & \text{in } \Omega_1 \\  sin(x^2+y^2-R^2)&, & \text{in } \Omega_2 \end{array} \right.
\end{equation}
<div class="org-src-container">

<pre class="src src-pde" id="sol"><span class="linenr">16: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">solution u- in 'inner' domain (Omega_1)</span>
<span class="linenr">17: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> solneg
<span class="linenr">18: </span>0.5,
<span class="linenr">19: </span>
<span class="linenr">20: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">solution u+ in 'outer' domain (Omega_2)</span>
<span class="linenr">21: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">coefficient</span> solpos
<span class="linenr">22: </span>(sin((x*x+y*y-R*R))),
</pre>
</div>
</div>
</div>
