pde_tutorial/d1_approx.org
** (Extended) Finite element space   
   We now want to define the finite element space to achieve the best approximation with.
   We create an instance of an [[(fescomptype)][extended 'standard' finite element space]] which is a compound
   space of a standard finite element space and the space of enrichment functions relative 
   to this space. 
   The underlying standard finite element space is defined with the [[(fesstdtype)][type_std]]-flag while other 
   parameters (e.g. [[(fesorder)][the order]]) of the FESpace are passed to that standard FESpace.
   The extended FESpace which is the second component of the compound space handles the enrichtment
   of the standard space and deals with the following information
  * a reference fespace (here: the underlying continuous FESpace)
  * geometry information which consists of two parts:
    * a level set coefficient function
    * parameters for the approximation of the zero level of the level set function. This is done with 
      the flag [[(geometryref)][ref_space]] which prescribes how many levels of adaptive refinement
      on a local element are applied to resolve the zero level.
  * The [[(empty)][empty-flag]] can be used to *switch* the enrichment *off* while keeping the data structures
    for the geometry handling (essentially the composite numerical integration).
  #+NAME: xfespace
  #+BEGIN_SRC pde +n -r
  # use an "extended" continuous finite element space
  # you may change the order here
  define fespace fescomp                                            (ref:fescomp)
         -type=xstdfespace                                      (ref:fescomptype)
         -type_std=h1ho                                          (ref:fesstdtype)
         -order=1                                                  (ref:fesorder)
         -ref_space=1                                           (ref:geometryref)
  #       -empty                                                      (ref:empty)
  #+END_SRC 
  Alternatively one could use a discontinuous finite element space as the underlying 
  'standard' finite element space. To this end, replace the last code block with something
  like
  #+NAME: xfespacealt
  #+BEGIN_SRC pde -r :tangle no
  define fespace fescomp  
         -type=xstdfespace
         -type_std=l2ho   
         -order=0         
         -ref_space=1     
  #+END_SRC 
  
  At this point the XStdFESpace and especially the XFESpace has no information about the geometry as no 
  level set information is passed, yet. This is done externally with a [[(numprocinform)][numproc]] 
  which passes the information of the [[(passlset)][corresponding level set function]] to 
  the [[(passfes)][XStdFESpace]].
  #+NAME: numprocinform
  #+BEGIN_SRC pde +n -r
  #update "extended" part of XFE space:
  numproc informxfem npix                                     (ref:numprocinform)
          -xstdfespace=fescomp                                      (ref:passfes)
          -coef_levelset=lset                                      (ref:passlset)
  #+END_SRC 

** Gridfunction, linear and bilinear forms  
Now we create a gridfunction for the solution vector 
and define the bi- and linear forms for the matrix and the r.h.s. vector for the 
discrete problem. Special integrators suitable for the extended finite element space
are used, [[(xsource)][xsource]] and [[(xmass)][xmass]]. Both take two coefficient functions
as arguments. One cofficient function for each domain. Note that the problem is symmetric.
  #+NAME: comp
  #+BEGIN_SRC pde +n -r
define gridfunction u -fespace=fescomp

# integration on sub domains
define linearform f -fespace=fescomp
xsource solneg solpos                             (ref:xsource)

# integration on sub domains
define bilinearform a -fespace=fescomp -symmetric -linearform=f
xmass 1.0 1.0                                       (ref:xmass)
  #+END_SRC 

** Solver  
To solve the arising linear system we use [[(direct)][direct solver]] as a preconditioner. Alternatively, one could also use the
[[(jacobi)][Jacobi-preconditioner]]. Then, the problem is solved and the solution is stored in the gridfunction u.
  #+NAME: bvp
  #+BEGIN_SRC pde +n -r
#define preconditioner c -type=local -bilinearform=a -test #-block           (ref:jacobi)
define preconditioner c -type=direct -bilinearform=a -inverse=pardiso #-test (ref:direct)

numproc bvp npbvp -gridfunction=u -bilinearform=a -linearform=f -solver=cg -preconditioner=c -maxsteps=1000 -prec=1e-6 
  #+END_SRC 
  
** Visualization
The solution is visualized. 
  #+NAME: xvis
  #+BEGIN_SRC pde +n -r
numproc visualization npviz -scalarfunction=u 
    -minval=0 -maxval=1 
    -nolineartexture -deformationscale=1 -subdivision=4
  #+END_SRC 
  
