pde_tutorial/d1_approx.html
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> (Extended) Finite element space</h3>
<div class="outline-text-3" id="text-2-4">
<p>
We now want to define the finite element space to achieve the best approximation with.
We create an instance of an <a href="#coderef-fescomptype"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fescomptype');" onmouseout="CodeHighlightOff(this, 'coderef-fescomptype');">extended 'standard' finite element space</a> which is a compound
space of a standard finite element space and the space of enrichment functions relative 
to this space. 
The underlying standard finite element space is defined with the <a href="#coderef-fesstdtype"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fesstdtype');" onmouseout="CodeHighlightOff(this, 'coderef-fesstdtype');">type_std</a>-flag while other 
parameters (e.g. <a href="#coderef-fesorder"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fesorder');" onmouseout="CodeHighlightOff(this, 'coderef-fesorder');">the order</a>) of the FESpace are passed to that standard FESpace.
The extended FESpace which is the second component of the compound space handles the enrichtment
of the standard space and deals with the following information
</p>
<ul class="org-ul">
<li>a reference fespace (here: the underlying continuous FESpace)
</li>
<li>geometry information which consists of two parts:
<ul class="org-ul">
<li>a level set coefficient function
</li>
<li>parameters for the approximation of the zero level of the level set function. This is done with 
the flag <a href="#coderef-geometryref"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-geometryref');" onmouseout="CodeHighlightOff(this, 'coderef-geometryref');">ref_space</a> which prescribes how many levels of adaptive refinement
on a local element are applied to resolve the zero level.
</li>
</ul>
</li>
<li>The <a href="#coderef-empty"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-empty');" onmouseout="CodeHighlightOff(this, 'coderef-empty');">empty-flag</a> can be used to <b>switch</b> the enrichment <b>off</b> while keeping the data structures
for the geometry handling (essentially the composite numerical integration).
</li>
</ul>
<div class="org-src-container">

<pre class="src src-pde" id="xfespace"><span class="linenr">23: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">use an "extended" continuous finite element space</span>
<span class="linenr">24: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">you may change the order here</span>
<span id="coderef-fescomp" class="coderef-off"><span class="linenr">25: </span><span style="color: #e5786d;">define</span><span style="color: #e5786d;"> fespace</span> fescomp</span>
<span id="coderef-fescomptype" class="coderef-off"><span class="linenr">26: </span>       -<span style="color: #cae682;">type</span>=xstd<span style="color: #e5786d;">fespace</span></span>
<span id="coderef-fesstdtype" class="coderef-off"><span class="linenr">27: </span>       -<span style="color: #cae682;">type</span>_std=h1ho</span>
<span id="coderef-fesorder" class="coderef-off"><span class="linenr">28: </span>       -<span style="color: #cae682;">order</span>=1</span>
<span id="coderef-geometryref" class="coderef-off"><span class="linenr">29: </span>       -ref_space=1</span>
<span id="coderef-empty" class="coderef-off"><span class="linenr">30: </span><span style="color: #99968b;">#       </span><span style="color: #99968b;">-empty</span></span>
</pre>
</div>
<p>
Alternatively one could use a discontinuous finite element space as the underlying 
'standard' finite element space. To this end, replace the last code block with something
like
</p>
<div class="org-src-container">

<pre class="src src-pde" id="xfespacealt"><span style="color: #e5786d;">define</span><span style="color: #e5786d;"> fespace</span> fescomp  
       -<span style="color: #cae682;">type</span>=xstd<span style="color: #e5786d;">fespace</span>
       -<span style="color: #cae682;">type</span>_std=l2ho   
       -<span style="color: #cae682;">order</span>=0         
       -ref_space=1
</pre>
</div>

<p>
At this point the XStdFESpace and especially the XFESpace has no information about the geometry as no 
level set information is passed, yet. This is done externally with a <a href="#coderef-numprocinform"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-numprocinform');" onmouseout="CodeHighlightOff(this, 'coderef-numprocinform');">numproc</a> 
which passes the information of the <a href="#coderef-passlset"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-passlset');" onmouseout="CodeHighlightOff(this, 'coderef-passlset');">corresponding level set function</a> to 
the <a href="#coderef-passfes"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-passfes');" onmouseout="CodeHighlightOff(this, 'coderef-passfes');">XStdFESpace</a>.
</p>
<div class="org-src-container">

<pre class="src src-pde" id="numprocinform"><span class="linenr">31: </span><span style="color: #99968b;">#</span><span style="color: #99968b;">update "extended" part of XFE space:</span>
<span id="coderef-numprocinform" class="coderef-off"><span class="linenr">32: </span><span style="color: #e5786d;">numproc</span> informxfem npix</span>
<span id="coderef-passfes" class="coderef-off"><span class="linenr">33: </span>        -xstd<span style="color: #e5786d;">fespace</span>=fescomp</span>
<span id="coderef-passlset" class="coderef-off"><span class="linenr">34: </span>        -coef_levelset=lset</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Gridfunction, linear and bilinear forms</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Now we create a gridfunction for the solution vector 
and define the bi- and linear forms for the matrix and the r.h.s. vector for the 
discrete problem. Special integrators suitable for the extended finite element space
are used, <a href="#coderef-xsource"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-xsource');" onmouseout="CodeHighlightOff(this, 'coderef-xsource');">xsource</a> and <a href="#coderef-xmass"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-xmass');" onmouseout="CodeHighlightOff(this, 'coderef-xmass');">xmass</a>. Both take two coefficient functions
as arguments. One cofficient function for each domain. Note that the problem is symmetric.
</p>
<div class="org-src-container">

<pre class="src src-pde" id="comp"><span class="linenr">35: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">gridfunction</span> u -<span style="color: #e5786d;">fespace</span>=fescomp
<span class="linenr">36: </span>
<span class="linenr">37: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">integration on sub domains</span>
<span class="linenr">38: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">linearform</span> f -<span style="color: #e5786d;">fespace</span>=fescomp
<span id="coderef-xsource" class="coderef-off"><span class="linenr">39: </span>xsource solneg solpos</span>
<span class="linenr">40: </span>
<span class="linenr">41: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">integration on sub domains</span>
<span class="linenr">42: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">bilinearform</span> a -<span style="color: #e5786d;">fespace</span>=fescomp -symmetric -<span style="color: #e5786d;">linearform</span>=f
<span id="coderef-xmass" class="coderef-off"><span class="linenr">43: </span>xmass 1.0 1.0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Solver</h3>
<div class="outline-text-3" id="text-2-6">
<p>
To solve the arising linear system we use <a href="#coderef-direct"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-direct');" onmouseout="CodeHighlightOff(this, 'coderef-direct');">direct solver</a> as a preconditioner. Alternatively, one could also use the
<a href="#coderef-jacobi"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-jacobi');" onmouseout="CodeHighlightOff(this, 'coderef-jacobi');">Jacobi-preconditioner</a>. Then, the problem is solved and the solution is stored in the gridfunction u.
</p>
<div class="org-src-container">

<pre class="src src-pde" id="bvp"><span id="coderef-jacobi" class="coderef-off"><span class="linenr">44: </span><span style="color: #99968b;">#</span><span style="color: #99968b;">define preconditioner c -type=local -bilinearform=a -test #-block</span></span>
<span id="coderef-direct" class="coderef-off"><span class="linenr">45: </span><span style="color: #e5786d;">define</span> <span style="color: #e5786d;">preconditioner</span> c -<span style="color: #cae682;">type</span>=direct -<span style="color: #e5786d;">bilinearform</span>=a -<span style="color: #cae682;">inverse</span>=pardiso <span style="color: #99968b;">#</span><span style="color: #99968b;">-test</span></span>
<span class="linenr">46: </span>
<span class="linenr">47: </span><span style="color: #e5786d;">numproc</span> bvp npbvp -<span style="color: #e5786d;">gridfunction</span>=u -<span style="color: #e5786d;">bilinearform</span>=a -<span style="color: #e5786d;">linearform</span>=f -<span style="color: #cae682;">solver</span>=cg -<span style="color: #e5786d;">preconditioner</span>=c -maxsteps=1000 -prec=1e-6
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Visualization</h3>
<div class="outline-text-3" id="text-2-7">
<p>
The solution is visualized. 
</p>
<div class="org-src-container">

<pre class="src src-pde" id="xvis"><span class="linenr">48: </span><span style="color: #e5786d;">numproc</span> visualization npviz -scalarfunction=u 
<span class="linenr">49: </span>    -minval=0 -maxval=1 
<span class="linenr">50: </span>    -nolineartexture -deformationscale=1 -subdivision=4
</pre>
</div>
</div>
</div>
