pde_tutorial/d1_approx.org
** Error calculatoin
Finally, the error $u_h$ (discrete solution) to $u$ is calculated via numerical integration. 
  #+NAME: xdiff
  #+BEGIN_SRC pde +n -r
# evaluate l2-error (difference between prescribed solution and numerical solution)
numproc xdifference npxd 
        -solution=u 
        -solution_n=solneg
        -solution_p=solpos
        -intorder=3
  #+END_SRC
After reading the explanation, start netgen and inspect the result of the simulation. 
In the next section a few small tasks are suggested to investigate some important properties
of the XFEM discretization.
** Things to try with the pde-file here:
 1) Add the following line, reload the pde-file, invoke solve and navigate through
    the shape functions with the GUI:
  #+BEGIN_SRC pde -r :tangle no
numproc shapetester npst -gridfunction=u
  #+END_SRC 
    To see all shape functions make sure that subdivisions are at least 3 and disable automatic 
    scaling. Instead use minval=0 and maxval=1. Afterwards remove the line again
 2) Refine the mesh and observe the convergence order. Note that different error calculations 
    are printed. Not all of them are meaningful (e.g. the interface measures). We are primarily 
    interested in the $L^2$-error.
 3) Set flag "empty" (this removes the enrichted functions)
    for xstdfespace, refine the mesh and observe the 
    convergence order (L2). Afterwards remove "empty" again.
 4) Set "order" to 2 and try 1) - 3) again, make sure to 
    increase "ref_space" in xstdfespace and "intorder" in 
    xdifference
 5) set "order" back to 1, set the preconditioner to "local" 
    and add the "-test"-flags, refine the mesh several times
    and observe the performance
 6) set "order" to 2 and try 5) again

* Additional investigations with python  
Some interesting information can be read from python through the corresponding interface. 
A very small introduction is given here. These things result in the python script [[file:d1_approx.py][d1_approx.py]].
** Simple python start-off
   At the beginning we briefly announce ourselves with a friendly "hello":
   #+NAME: start
   #+BEGIN_SRC python -n -r :exports both
   # interactive modifications to d1_approx.py
   print ("hello from d1_approx.py ;-)")
   #+END_SRC
   
   which simply results in:
   #+RESULTS: start
   
** Import ngsolve and xfem functionality to python <<pymodule>>
   Then we import a lot of functionality from ngsolve and ngsxfem.
   #+NAME: imports
   #+BEGIN_SRC python +n -r
   from ngsolve.solve import *
   from ngsolve.comp import *
   from ngsolve.fem import *
   from ngsolve.la import *
   from ngsolve.bla import *
   import ngsolve.ngstd as ngstd
   from ngsolve.solve import Redraw

   #from libngsxfem_py.xfem import *
   import libngsxfem_py.xfem as xfem                                 (ref:libxfem)

   from math import sin                                                  (ref:sin)
   from time import sleep                                              (ref:sleep)
   #+END_SRC
   We included the command [[(sin)][sin]] for no reason.
   We included the command [[(sleep)][sleep]] to pause between the individual shape functions.
   
** Small functions for inspections:
   We use some really basic things, e.g. reading the d.o.f. of a triangle or fixing the solution vector. 
*** Print dofs per elements:
    We simply display the degrees of freedom for each element when "PrintDofs" is called.
    #+NAME: printdofs
    #+BEGIN_SRC python +n -r
   def PrintDofs(pde,mesh,fes):
       print ("Printing dofs per element:\n\n")
       for i in mesh.Elements():
           print("dofnrs of element", i, ":\n", fes.GetDofNrs(i))
    #+END_SRC
    
*** Show shape functions
    Every (extended) finite element function can be represented as
    \begin{equation}
    u = \sum_{i=1}^{N} u_i \phi(x) + \sum_{i=1}^{N_x} u_i^x \phi^x(x).
    \end{equation}
    By setting the coefficients $u_i$, $u_i^x$ [[(setzero)][to zero]] and only [[(shapefct)][one coefficient to 1]], we can construct
    $u = \phi(x)$ or $u = \phi^x(x)$. We do this for [[(eachshp)][every shape function]] 
    and call a [[(redraw)][Redraw]] and a [[(slp)][short delay]] between the functions.
    #+NAME: shapetest
    #+BEGIN_SRC python +n -r
   def ShapeTest(pde,u):
       print ("Shape test:\n")
       u[:][:] = 0                                                   (ref:setzero)
       for i in range(u.size):                                       (ref:eachshp)
           print ("i = ", i ,".")
           u[:][i-1] = 0.0
           u[:][i] = 1.0                                            (ref:shapefct)
           Redraw(blocking=True)                                      (ref:redraw)
           sleep(1)                                                      (ref:slp)
    #+END_SRC
    
