pde_tutorial/d1_approx.html

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Error calculatoin</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Finally, the error \(u_h\) (discrete solution) to \(u\) is calculated via numerical integration. 
</p>
<div class="org-src-container">

<pre class="src src-pde" id="xdiff"><span class="linenr">51: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">evaluate l2-error (difference between prescribed solution and numerical solution)</span>
<span class="linenr">52: </span><span style="color: #e5786d;">numproc</span> xdifference npxd 
<span class="linenr">53: </span>        -<span style="color: #cae682;">solution</span>=u 
<span class="linenr">54: </span>        -<span style="color: #cae682;">solution</span>_n=solneg
<span class="linenr">55: </span>        -<span style="color: #cae682;">solution</span>_p=solpos
<span class="linenr">56: </span>        -int<span style="color: #cae682;">order</span>=3
</pre>
</div>
<p>
After reading the explanation, start netgen and inspect the result of the simulation. 
In the next section a few small tasks are suggested to investigate some important properties
of the XFEM discretization.
</p>
</div>
</div>
<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Things to try with the pde-file here:</h3>
<div class="outline-text-3" id="text-2-9">
<ol class="org-ol">
<li>Add the following line, reload the pde-file, invoke solve and navigate through
the shape functions with the GUI:
<div class="org-src-container">

<pre class="src src-pde"><span style="color: #e5786d;">numproc</span> shapetester npst -<span style="color: #e5786d;">gridfunction</span>=u
</pre>
</div>
<p>
To see all shape functions make sure that subdivisions are at least 3 and disable automatic 
scaling. Instead use minval=0 and maxval=1. Afterwards remove the line again
</p>
</li>
<li>Refine the mesh and observe the convergence order. Note that different error calculations 
are printed. Not all of them are meaningful (e.g. the interface measures). We are primarily 
interested in the \(L^2\)-error.
</li>
<li>Set flag "empty" (this removes the enrichted functions)
for xstdfespace, refine the mesh and observe the 
convergence order (L2). Afterwards remove "empty" again.
</li>
<li>Set "order" to 2 and try 1) - 3) again, make sure to 
increase "ref_space" in xstdfespace and "intorder" in 
xdifference
</li>
<li>set "order" back to 1, set the preconditioner to "local" 
and add the "-test"-flags, refine the mesh several times
and observe the performance
</li>
<li>set "order" to 2 and try 5) again
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Additional investigations with python</h2>
<div class="outline-text-2" id="text-3">
<p>
Some interesting information can be read from python through the corresponding interface. 
A very small introduction is given here. These things result in the python script <a href="d1_approx.py">d1_approx.py</a>.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Simple python start-off</h3>
<div class="outline-text-3" id="text-3-1">
<p>
At the beginning we briefly announce ourselves with a friendly "hello":
</p>
<div class="org-src-container">

<pre class="src src-python" id="start"><span class="linenr">1: </span><span style="color: #99968b;"># </span><span style="color: #99968b;">interactive modifications to d1_approx.py</span>
<span class="linenr">2: </span><span style="color: #8ac6f2; font-weight: bold;">print</span> (<span style="color: #95e454;">"hello from d1_approx.py ;-)"</span>)
</pre>
</div>

<p>
which simply results in:
</p>
<div class="org-src-container">

<pre class="src src-org">hello from d1_approx.py ;-)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Import ngsolve and xfem functionality to python <a id="pymodule" name="pymodule"></a></h3>
<div class="outline-text-3" id="text-3-2">
<p>
Then we import a lot of functionality from ngsolve and ngsxfem.
</p>
<div class="org-src-container">

<pre class="src src-python" id="imports"><span class="linenr"> 3: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> ngsolve.solve <span style="color: #8ac6f2; font-weight: bold;">import</span> *
<span class="linenr"> 4: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> ngsolve.comp <span style="color: #8ac6f2; font-weight: bold;">import</span> *
<span class="linenr"> 5: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> ngsolve.fem <span style="color: #8ac6f2; font-weight: bold;">import</span> *
<span class="linenr"> 6: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> ngsolve.la <span style="color: #8ac6f2; font-weight: bold;">import</span> *
<span class="linenr"> 7: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> ngsolve.bla <span style="color: #8ac6f2; font-weight: bold;">import</span> *
<span class="linenr"> 8: </span><span style="color: #8ac6f2; font-weight: bold;">import</span> ngsolve.ngstd <span style="color: #8ac6f2; font-weight: bold;">as</span> ngstd
<span class="linenr"> 9: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> ngsolve.solve <span style="color: #8ac6f2; font-weight: bold;">import</span> Redraw
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #99968b;">#</span><span style="color: #99968b;">from libngsxfem_py.xfem import *</span>
<span id="coderef-libxfem" class="coderef-off"><span class="linenr">12: </span><span style="color: #8ac6f2; font-weight: bold;">import</span> libngsxfem_py.xfem <span style="color: #8ac6f2; font-weight: bold;">as</span> xfem</span>
<span class="linenr">13: </span>
<span id="coderef-sin" class="coderef-off"><span class="linenr">14: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> math <span style="color: #8ac6f2; font-weight: bold;">import</span> sin</span>
<span id="coderef-sleep" class="coderef-off"><span class="linenr">15: </span><span style="color: #8ac6f2; font-weight: bold;">from</span> time <span style="color: #8ac6f2; font-weight: bold;">import</span> sleep</span>
</pre>
</div>
<p>
We included the command <a href="#coderef-sin"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-sin');" onmouseout="CodeHighlightOff(this, 'coderef-sin');">sin</a> for no reason.
We included the command <a href="#coderef-sleep"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-sleep');" onmouseout="CodeHighlightOff(this, 'coderef-sleep');">sleep</a> to pause between the individual shape functions.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Small functions for inspections:</h3>
<div class="outline-text-3" id="text-3-3">
<p>
We use some really basic things, e.g. reading the d.o.f. of a triangle or fixing the solution vector. 
</p>
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Print dofs per elements:</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
We simply display the degrees of freedom for each element when "PrintDofs" is called.
</p>
<div class="org-src-container">

<pre class="src src-python" id="printdofs"><span class="linenr">16: </span><span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">PrintDofs</span>(pde,mesh,fes):
<span class="linenr">17: </span>    <span style="color: #8ac6f2; font-weight: bold;">print</span> (<span style="color: #95e454;">"Printing dofs per element:\n\n"</span>)
<span class="linenr">18: </span>    <span style="color: #8ac6f2; font-weight: bold;">for</span> i <span style="color: #8ac6f2; font-weight: bold;">in</span> mesh.Elements():
<span class="linenr">19: </span>        <span style="color: #8ac6f2; font-weight: bold;">print</span>(<span style="color: #95e454;">"dofnrs of element"</span>, i, <span style="color: #95e454;">":\n"</span>, fes.GetDofNrs(i))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Show shape functions</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Every (extended) finite element function can be represented as
</p>
\begin{equation}
u = \sum_{i=1}^{N} u_i \phi(x) + \sum_{i=1}^{N_x} u_i^x \phi^x(x).
\end{equation}
<p>
By setting the coefficients \(u_i\), \(u_i^x\) <a href="#coderef-setzero"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-setzero');" onmouseout="CodeHighlightOff(this, 'coderef-setzero');">to zero</a> and only <a href="#coderef-shapefct"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-shapefct');" onmouseout="CodeHighlightOff(this, 'coderef-shapefct');">one coefficient to 1</a>, we can construct
\(u = \phi(x)\) or \(u = \phi^x(x)\). We do this for <a href="#coderef-eachshp"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-eachshp');" onmouseout="CodeHighlightOff(this, 'coderef-eachshp');">every shape function</a> 
and call a <a href="#coderef-redraw"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-redraw');" onmouseout="CodeHighlightOff(this, 'coderef-redraw');">Redraw</a> and a <a href="#coderef-slp"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-slp');" onmouseout="CodeHighlightOff(this, 'coderef-slp');">short delay</a> between the functions.
</p>
<div class="org-src-container">

<pre class="src src-python" id="shapetest"><span class="linenr">20: </span><span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">ShapeTest</span>(pde,u):
<span class="linenr">21: </span>    <span style="color: #8ac6f2; font-weight: bold;">print</span> (<span style="color: #95e454;">"Shape test:\n"</span>)
<span id="coderef-setzero" class="coderef-off"><span class="linenr">22: </span>    u[:][:] = 0</span>
<span id="coderef-eachshp" class="coderef-off"><span class="linenr">23: </span>    <span style="color: #8ac6f2; font-weight: bold;">for</span> i <span style="color: #8ac6f2; font-weight: bold;">in</span> <span style="color: #e5786d;">range</span>(u.size):</span>
<span class="linenr">24: </span>        <span style="color: #8ac6f2; font-weight: bold;">print</span> (<span style="color: #95e454;">"i = "</span>, i ,<span style="color: #95e454;">"."</span>)
<span class="linenr">25: </span>        u[:][i-1] = 0.0
<span id="coderef-shapefct" class="coderef-off"><span class="linenr">26: </span>        u[:][i] = 1.0</span>
<span id="coderef-redraw" class="coderef-off"><span class="linenr">27: </span>        Redraw(blocking=<span style="color: #e5786d;">True</span>)</span>
<span id="coderef-slp" class="coderef-off"><span class="linenr">28: </span>        sleep(1)</span>
</pre>
</div>
</div>
</div>
</div>
